import React from "react";
import styles from "../../../src/components/nav/navigation.module.css";
import { useState } from "react";
import { Link, NavLink } from "react-router-dom";
import NotificationAccount from "../notifications/account/account";

/* Info about links */

const linksNav = [
    {
        href: "/dashboard",
        icon: <svg width="43" height="43" viewBox="0 0 43 43" fill="none">
            <path d="M8.95837 22.861C8.95837 20.4283 8.95837 19.212 9.45012 18.1428C9.94186 17.0737 10.8654 16.2821 12.7124 14.699L14.504 13.1632C17.8425 10.3017 19.5117 8.87096 21.5 8.87096C23.4884 8.87096 25.1576 10.3017 28.496 13.1632L30.2877 14.699C32.1347 16.2821 33.0582 17.0737 33.55 18.1428C34.0417 19.212 34.0417 20.4283 34.0417 22.861V30.4583C34.0417 33.8367 34.0417 35.5259 32.9922 36.5755C31.9426 37.625 30.2534 37.625 26.875 37.625H16.125C12.7466 37.625 11.0574 37.625 10.0079 36.5755C8.95837 35.5259 8.95837 33.8367 8.95837 30.4583V22.861Z" stroke="#222222" />
            <path d="M25.9792 37.625V27.875C25.9792 27.3227 25.5315 26.875 24.9792 26.875H18.0209C17.4686 26.875 17.0209 27.3227 17.0209 27.875V37.625" stroke="#222222" strokeLinecap="round" strokeLinejoin="round" />
        </svg>,
        title: "Главная"
    },
    {
        href: "/clients",
        icon: <svg width="43" height="43" viewBox="0 0 43 43" fill="none">
            <path d="M35.3449 36.6344C34.5283 34.3486 32.7288 32.3287 30.2255 30.8881C27.7223 29.4475 24.6552 28.6667 21.5 28.6667C18.3447 28.6667 15.2776 29.4475 12.7744 30.8881C10.2711 32.3287 8.47166 34.3486 7.65502 36.6344" stroke="#222222" strokeLinecap="round" />
            <circle cx="21.5" cy="14.3333" r="7.16667" stroke="#222222" strokeLinecap="round" />
        </svg>,
        title: "Клиенты",
    },
    {
        href: "/orders",
        icon: <svg width="43" height="43" viewBox="0 0 43 43" fill="none">
            <path d="M6.27087 8.0625H10.2044C10.9001 8.0625 11.2479 8.0625 11.5098 8.25126C11.7717 8.44002 11.8817 8.77003 12.1017 9.43004L13.4375 13.4375" stroke="#222222" strokeLinecap="round" />
            <path d="M31.3542 31.3542H14.4207C13.1545 31.3542 12.5214 31.3542 12.2221 30.9389C11.9227 30.5236 12.1233 29.9218 12.5246 28.7181V28.7181C12.9654 27.3955 13.1859 26.7342 13.7096 26.3567C14.2334 25.9792 14.9291 25.9792 16.3206 25.9792H25.9792" stroke="#222222" strokeLinecap="round" strokeLinejoin="round" />
            <path d="M27.2412 25.9792H17.8667C16.5875 25.9792 15.9479 25.9792 15.4469 25.6488C14.946 25.3185 14.694 24.7306 14.1901 23.5548L11.6463 17.6193C10.8368 15.7304 10.4321 14.786 10.8767 14.1118C11.3213 13.4375 12.3488 13.4375 14.4037 13.4375H31.5596C33.8586 13.4375 35.0082 13.4375 35.4417 14.1846C35.8753 14.9317 35.305 15.9298 34.1643 17.9259L30.7141 23.9637C30.1522 24.9471 29.8712 25.4388 29.4057 25.709C28.9401 25.9792 28.3738 25.9792 27.2412 25.9792Z" stroke="#222222" strokeLinecap="round" />
            <circle cx="30.4583" cy="35.8334" r="1.79167" fill="#222222" />
            <circle cx="16.125" cy="35.8334" r="1.79167" fill="#222222" />
        </svg>,
        title: "Заказы"
    },
    {
        href: "/sells",
        icon: <svg width="43" height="43" viewBox="0 0 43 43" fill="none">
            <path d="M18.8125 27.7708L17.0209 21.5" stroke="#222222" strokeLinecap="round" />
            <path d="M15.2292 11.6458L11.6459 17.0208M27.7709 11.6458L31.3542 17.0208" stroke="#222222" strokeLinecap="round" />
            <path d="M24.1875 27.7708L25.9792 21.5" stroke="#222222" strokeLinecap="round" />
            <path d="M8.0625 17.0208V17.0208C8.24003 17.0208 8.3288 17.0208 8.40753 17.0271C9.22568 17.0918 9.92125 17.6497 10.1619 18.4344C10.1851 18.5099 10.2043 18.5965 10.2428 18.7698L12.7414 30.0136C13.0751 31.5152 13.242 32.266 13.7904 32.7059C14.3388 33.1458 15.1079 33.1458 16.6462 33.1458H26.3538C27.8921 33.1458 28.6612 33.1458 29.2096 32.7059C29.758 32.266 29.9249 31.5152 30.2586 30.0136L32.7572 18.7698C32.7957 18.5965 32.8149 18.5099 32.8381 18.4344C33.0787 17.6497 33.7743 17.0918 34.5925 17.0271C34.6712 17.0208 34.76 17.0208 34.9375 17.0208V17.0208" stroke="#222222" strokeLinecap="round" />
            <path d="M6.27087 17.0208H36.7292" stroke="#222222" strokeLinecap="round" />
        </svg>,
        title: "Продажи",
    },
    {
        href: "/partners",
        icon: <svg width="43" height="43" viewBox="0 0 43 43" fill="none">
            <circle cx="21.5" cy="14.3333" r="4.875" stroke="#222222" strokeLinecap="round" />
            <path d="M24.3247 11.4479C24.7182 10.7663 25.305 10.2168 26.0109 9.86869C26.7167 9.52061 27.5099 9.38965 28.2902 9.49237C29.0705 9.5951 29.8027 9.92689 30.3944 10.4458C30.9861 10.9647 31.4107 11.6474 31.6144 12.4076C31.8181 13.1678 31.7918 13.9713 31.5388 14.7166C31.2858 15.4618 30.8175 16.1153 30.1932 16.5944C29.5688 17.0735 28.8164 17.3567 28.031 17.4081C27.2457 17.4596 26.4628 17.2771 25.7812 16.8836" stroke="#222222" />
            <path d="M18.6753 11.4479C18.2818 10.7663 17.695 10.2168 16.9891 9.86869C16.2833 9.52061 15.4901 9.38965 14.7098 9.49237C13.9295 9.5951 13.1973 9.92689 12.6056 10.4458C12.0139 10.9647 11.5893 11.6474 11.3856 12.4076C11.1819 13.1678 11.2082 13.9713 11.4612 14.7166C11.7142 15.4618 12.1825 16.1153 12.8068 16.5944C13.4312 17.0735 14.1836 17.3567 14.969 17.4081C15.7543 17.4596 16.5372 17.2771 17.2188 16.8836" stroke="#222222" />
            <path d="M21.5 22.3958C29.5014 22.3958 31.0058 29.4834 31.2887 32.1486C31.347 32.6978 30.9065 33.1458 30.3542 33.1458H12.6459C12.0936 33.1458 11.6531 32.6978 11.7114 32.1486C11.9942 29.4834 13.4987 22.3958 21.5 22.3958Z" stroke="#222222" strokeLinecap="round" />
            <path d="M34.7636 28.472L35.2541 28.3752V28.3752L34.7636 28.472ZM23.4478 22.5498L23.0785 22.2126L22.4581 22.8922L23.3658 23.043L23.4478 22.5498ZM30.7832 29.5625L30.3029 29.7015L30.4074 30.0625H30.7832V29.5625ZM27.7709 21.1042C29.9991 21.1042 31.4915 22.3354 32.5094 23.9136C33.5353 25.5042 34.042 27.3991 34.2731 28.5689L35.2541 28.3752C35.0135 27.1571 34.4762 25.1181 33.3498 23.3716C32.2154 21.6129 30.4473 20.1042 27.7709 20.1042V21.1042ZM23.817 22.8869C24.775 21.8377 26.0477 21.1042 27.7709 21.1042V20.1042C25.7198 20.1042 24.1918 20.9933 23.0785 22.2126L23.817 22.8869ZM23.3658 23.043C27.705 23.7641 29.5273 27.0206 30.3029 29.7015L31.2635 29.4235C30.4388 26.5731 28.4183 22.8689 23.5297 22.0565L23.3658 23.043ZM33.8325 29.0625H30.7832V30.0625H33.8325V29.0625ZM34.2731 28.5689C34.3215 28.8143 34.1361 29.0625 33.8325 29.0625V30.0625C34.7121 30.0625 35.4349 29.2906 35.2541 28.3752L34.2731 28.5689Z" fill="#222222" />
            <path d="M19.5523 22.5498L19.6343 23.043L20.542 22.8922L19.9215 22.2126L19.5523 22.5498ZM8.23643 28.472L7.7459 28.3752L8.23643 28.472ZM12.2168 29.5625V30.0625H12.5927L12.6971 29.7015L12.2168 29.5625ZM15.2292 21.1042C16.9524 21.1042 18.2251 21.8377 19.1831 22.8869L19.9215 22.2126C18.8082 20.9933 17.2803 20.1042 15.2292 20.1042V21.1042ZM8.72695 28.5689C8.95799 27.3991 9.46474 25.5042 10.4906 23.9136C11.5086 22.3354 13.001 21.1042 15.2292 21.1042V20.1042C12.5528 20.1042 10.7846 21.6129 9.65028 23.3716C8.52383 25.118 7.98648 27.157 7.7459 28.3752L8.72695 28.5689ZM9.16751 29.0625C8.86388 29.0625 8.67849 28.8143 8.72695 28.5689L7.7459 28.3752C7.5651 29.2906 8.28789 30.0625 9.16751 30.0625V29.0625ZM12.2168 29.0625H9.16751V30.0625H12.2168V29.0625ZM12.6971 29.7015C13.4728 27.0206 15.2951 23.7641 19.6343 23.043L19.4703 22.0565C14.5817 22.8689 12.5612 26.5731 11.7365 29.4235L12.6971 29.7015Z" fill="#222222" />
        </svg>,
        title: "Партнеры",
    },
    {
        href: "/products",
        icon: "",
        title: "Продукты",
    }
]

const hideMenu = <svg width="49" height="49" viewBox="0 0 49 49" fill="none"><path d="M10.2084 14.2917H38.7917" stroke="#222222" stroke-linecap="round" /><path d="M10.2084 24.5H30.625" stroke="#222222" stroke-linecap="round" /><path d="M10.2084 34.7083H22.4584" stroke="#222222" stroke-linecap="round" /></svg>
const showMenu = <svg width="49" height="49" viewBox="0 0 49 49" fill="none"><path d="M10.2084 14.2917H38.7917" stroke="#222222" stroke-linecap="round" /><path d="M10.2084 24.5H38.7917" stroke="#222222" stroke-linecap="round" /><path d="M10.2084 34.7083H38.7917" stroke="#222222" stroke-linecap="round" /></svg>



/* Output links */


function Navigation() {

    const [isActive, setActive] = useState("false");
    const [menuActive, setMenu] = useState("false");

    function Change() {
        setActive(!isActive);
    }

    function openMenu() {
        setMenu(!menuActive);
    }

    return (
        <nav className={isActive ? styles.navActive : styles.navDisable}>
            <div className={styles.navHeader}>
                <p className={isActive ? styles.navTitleActive : styles.navTitleDisable}>Admin</p>
                <button className={styles.buttonNav} onClick={Change}>
                    {isActive ? hideMenu : showMenu}
                </button>
            </div>
            <div className="nav__main">
                <ul className="nav__list">
                    {linksNav.map((item, idx) =>
                        <li key={idx} className={styles.navItem}>
                            <NavLink className={isActive ? styles.navLinkActive : styles.navLinkDisable} to={item.href}>
                                <div className={isActive ? styles.iconSectionActive : styles.iconSectionDisable}>{item.icon}</div>
                                <p className={isActive ? styles.linkTitleActive : styles.linkTitleDisable}>{item.title}</p>
                            </NavLink>
                        </li>)}
                </ul>
            </div>
            <button className={styles.nav__footer} onClick={openMenu}>
                <p className={isActive ? styles.navUsernameActive : styles.navUsernameDisable}>{localStorage.getItem("user")}</p>
                <NotificationAccount openMenu={menuActive} name={isActive}/>
                <img src="/navigation/image/Avatar.svg" alt="User avatar" />
            </button>
        </nav>
    )
}

export default Navigation;